### Terraform :robot: Plan :memo: 
Status: `success` :white_check_mark:

Details:
<details>
<summary>Show Plan :eyes:</summary>

```
...[maybe truncated]
module.s3.random_uuid.encryption_key: Refreshing state... [id=312414b6-8213-378f-5ae7-19d513cc3d72]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.iam_roles_policies.aws_iam_policy.nullplatform_ecr_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-ecr-manager-policy]
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.aws_alb_controller.data.aws_region.current: Reading...
module.route53.data.aws_region.current: Reading...
module.iam_roles_policies.aws_iam_policy.nullplatform_metrics_api_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-metrics-api-policy]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_roles_policies.aws_iam_role.null-instance-role: Refreshing state... [id=null-instance-role]
module.s3.aws_s3_bucket.parameters-bucket: Refreshing state... [id=null-parameters-femsa-poc-demo]
module.iam_roles_policies.aws_iam_policy.nullplatform_route53_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-route53-manager-policy]
module.aws_alb_controller.module.lb_role.data.aws_partition.current: Reading...
module.aws_alb_controller.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam_roles_policies.aws_iam_policy.ecr-nullimages-read: Refreshing state... [id=arn:aws:iam::481665089566:policy/ecr-nullimages-read]
module.aws_alb_controller.module.lb_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=481665089566]
module.route53.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3.aws_secretsmanager_secret.nullservice_params_encryption: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:481665089566:secret:nullservice/params_encryption-mqPOxt]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05ae3f1f88bd81cd8]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=481665089566]
module.acm.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a]
module.s3.aws_s3_bucket.assets-bucket: Refreshing state... [id=null-assets-femsa-poc-demo]
module.aws_alb_controller.module.lb_role.data.aws_region.current: Reading...
module.aws_alb_controller.module.lb_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam_roles_policies.aws_iam_user.nullplatform_build_workflow_user: Refreshing state... [id=nullplatform-build-workflow-user]
module.iam_roles_policies.aws_iam_policy.nullplatform_alb_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-alb-manager-policy]
module.iam_roles_policies.aws_iam_policy.nullplatform_asg_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-asg-manager-policy]
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_roles_policies.aws_iam_policy.lambda-execution: Refreshing state... [id=arn:aws:iam::481665089566:policy/lambda-execution]
module.iam_roles_policies.aws_iam_policy.null-aws-logs-enablement: Refreshing state... [id=arn:aws:iam::481665089566:policy/null-aws-logs-enablement]
module.eks_config.data.aws_region.current: Reading...
module.eks_config.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.aws_alb_controller.module.lb_role.data.aws_caller_identity.current: Reading...
module.route53.aws_route53_zone.public_zone: Refreshing state... [id=Z054772710Q777Y4L1NE9]
module.aws_alb_controller.module.lb_role.data.aws_caller_identity.current: Read complete after 0s [id=481665089566]
module.iam_roles_policies.aws_iam_policy.nullplatform_eks_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-eks-manager-policy]
module.nullplatform_configuration.data.aws_caller_identity.current: Reading...
module.nullplatform_configuration.data.aws_caller_identity.current: Read complete after 0s [id=481665089566]
module.iam_roles_policies.aws_iam_policy.nullplatform_ecr_write_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-ecr-write-policy]
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.s3.aws_secretsmanager_secret_version.encryption_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:481665089566:secret:nullservice/params_encryption-mqPOxt|terraform-20241206165300564600000004]
module.iam_roles_policies.aws_iam_role.nullplatform_application_role: Refreshing state... [id=nullplatform-application-role]
module.iam_roles_policies.aws_iam_access_key.nullplatform_build_workflow_user_key: Refreshing state... [id=AKIAXAJL2AAPDN24NZGV]
module.iam_roles_policies.aws_iam_instance_profile.null-instance-profile: Refreshing state... [id=null-instance-profile]
module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-ecr-attach: Refreshing state... [id=null-instance-role-ecr-attach]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241203194841244800000002]
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::481665089566:assumed-role/github/GitHubActions]
module.iam_roles_policies.aws_iam_policy_attachment.null-instance-lambda-execution-attach: Refreshing state... [id=null-instance-role-lambda-execution]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-aws-logs-enablement: Refreshing state... [id=null-instance-role-s3-parameters-attach]
module.iam_roles_policies.aws_iam_user_policy.nullplatform_build_workflow_user_policy: Refreshing state... [id=nullplatform-build-workflow-user:ecr-write-policy]
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=3921743575]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=femsa-poc-cluster-cluster-20241203194842007000000004]
module.nullplatform_configuration.nullplatform_provider_config.lambda: Refreshing state... [id=03b3be30-64fc-4cc9-b422-8e841859023e]
module.iam_roles_policies.aws_iam_policy.null-params-read: Refreshing state... [id=arn:aws:iam::481665089566:policy/null-params-read]
module.iam_roles_policies.aws_iam_role.nullplatform_telemetry_manager_role: Refreshing state... [id=nullplatform-telemetry-manager-role]
module.aws_alb_controller.module.lb_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::481665089566:policy/AmazonEKS_AWS_Load_Balancer_Controller-20241203194842225500000005]
module.iam_roles_policies.aws_iam_policy.nullplatform-assets-write: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-assets-write]
module.iam_roles_policies.aws_iam_policy.nullplatform_lambda_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-lambda-manager-policy]
module.iam_roles_policies.aws_iam_policy.nullplatform_params_manager_policy: Refreshing state... [id=arn:aws:iam::481665089566:policy/nullplatform-params-manager-policy]
module.nullplatform_configuration.nullplatform_provider_config.s3: Refreshing state... [id=bb2eccca-f710-4653-ac00-65f6079b3cd2]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20241203194841244800000002-20241203194842572600000006]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241203194841244800000002-20241203194842760600000008]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241203194841244800000002-20241203194842770300000009]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241203194841244800000002-20241203194842674200000007]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=femsa-poc-cluster-cluster-20241203194842007000000004-2024120319484280570000000a]
module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-s3-parameters-read-attach: Refreshing state... [id=null-instance-role-s3-parameters-read-attach]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=femsa-poc-cluster-cluster-20241203194842007000000004-2024120319484465320000000b]
module.iam_roles_policies.aws_iam_user_policy.nullplatform_build_workflow_user_policy_s3: Refreshing state... [id=nullplatform-build-workflow-user:s3-write-policy]
module.nullplatform_configuration.nullplatform_provider_config.ec2: Refreshing state... [id=b2e0dda6-a6f8-4164-ae85-840d54e3b1cb]
module.nullplatform_configuration.nullplatform_provider_config.ecr: Refreshing state... [id=37012b5b-fe52-47a9-b54b-890664315a7e]
module.acm.aws_route53_record.cert_validation["*.femsa.nullapps.io"]: Refreshing state... [id=Z054772710Q777Y4L1NE9__b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io._CNAME]
module.iam_roles_policies.aws_iam_role.nullplatform_scope_workflow_role: Refreshing state... [id=nullplatform-scope-workflow-role]
module.acm.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08ce4cc7029fb301a]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0a56db9863c66456e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-063c241d67cae3437]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-094241eb90654a896]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07fd71421a00642dc]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038cc901dec5c4243]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05649d4e55557d4f4]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02e47e475785a2765]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09220b98f2628cc28]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00d1f27e753a8b24e]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-014d0e492af53b7f0]
module.route53.aws_route53_zone.private_zone: Refreshing state... [id=Z03063391HLDQ365UUBGL]
module.alb.aws_security_group.http-instance: Refreshing state... [id=sg-0cbfb3a5a8b75ae0b]
module.alb.aws_lb_target_group.default_target_group_internal: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:targetgroup/default-internal-tg/f5a9a4fb738a656b]
module.alb.aws_security_group.null-main-balancer: Refreshing state... [id=sg-03e5598e899677cd5]
module.alb.aws_lb_target_group.default_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:targetgroup/default-tg/72851c37edb6b13b]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b203a346ca331322]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0143995dd212ea034]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-069792e61f85a296a]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b2f8dd0ee10204da]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e785b587a57d07e3]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-006acfe6b999ba365]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02e47e475785a27651080289494]
module.alb.aws_vpc_security_group_egress_rule.allow_instance_all: Refreshing state... [id=sgr-0f18f89ab80751e4c]
module.alb.aws_vpc_security_group_ingress_rule.allow_instance_ssh: Refreshing state... [id=sgr-0051e57ae38e51a92]
module.alb.aws_vpc_security_group_ingress_rule.allow_instance_http_default_null: Refreshing state... [id=sgr-0a044b96b18716599]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0224fa98b4c7d3ade]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-031d111ce51b59243]
module.alb.aws_vpc_security_group_ingress_rule.allow_lb_https: Refreshing state... [id=sgr-0803cb920e92d42c0]
module.alb.aws_vpc_security_group_ingress_rule.allow_instance_http: Refreshing state... [id=sgr-0c97c14ac9e714436]
module.alb.aws_vpc_security_group_egress_rule.allow_lb_all: Refreshing state... [id=sgr-08b17bf099c0ede86]
module.alb.aws_vpc_security_group_ingress_rule.allow_lb_http: Refreshing state... [id=sgr-03b889bb7353ffa15]
module.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3361969766]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-598362988]
module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2183153548]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-362419831]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2460669093]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-4096861997]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-774864026]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3882687244]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2425361638]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2281040003]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3432530818]
module.nullplatform_configuration.nullplatform_provider_config.aws: Refreshing state... [id=29c681c5-7169-47f6-a69c-b34a9aff32be]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03032022c0fa2f537]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0415fae7313d3553d]
module.alb.aws_lb.null-main-balancer-internal: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:loadbalancer/app/null-main-balancer-internal/9d882a1d4412bdcc]
module.alb.aws_lb.null-main-balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:loadbalancer/app/null-main-balancer/2c2715efb5a36246]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=femsa-poc-cluster]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-094241eb90654a8961080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07fd71421a00642dc1080289494]
module.alb.aws_lb_listener.null-main-internal-listener-https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:listener/app/null-main-balancer-internal/9d882a1d4412bdcc/231224ef0ae8e54e]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["organization"]: Refreshing state... [id=sg-02f30072ad3796ca9,organization]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["account"]: Refreshing state... [id=sg-02f30072ad3796ca9,account]
module.eks.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 1s [id=aws-ebs-csi-driver]
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-03T20:01:59Z]
module.alb.aws_lb_listener.null-main-listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:listener/app/null-main-balancer/2c2715efb5a36246/73fbbb979ded9cab]
module.alb.aws_lb_listener.null-main-listener-https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:481665089566:listener/app/null-main-balancer/2c2715efb5a36246/3091ec1fd1c4e010]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::481665089566:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B443DA30768DE46FDB07157320E7EB36]
module.nullplatform_configuration.nullplatform_provider_config.eks: Refreshing state... [id=ecce6d25-1b04-4da5-aece-e2302c484875]
module.eks_config.helm_release.eks_config_helm: Refreshing state... [id=nullplatform-base]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0a4a6e95b8ac55746]
module.nullplatform_configuration.nullplatform_provider_config.network: Refreshing state... [id=80527e2c-40e0-473c-9f4f-de5afc7320ad]
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.this[0]: Reading...
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2432303708]
module.aws_alb_controller.module.lb_role.aws_iam_role.this[0]: Refreshing state... [id=femsa-poc-cluster_eks_lb]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=femsa-poc-cluster:default-20241203200205855300000017]
module.aws_alb_controller.module.lb_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=femsa-poc-cluster_eks_lb-20241203200131203500000014]
module.aws_alb_controller.kubernetes_service_account.service-account: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=femsa-poc-cluster:vpc-cni]
module.eks.module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=femsa-poc-cluster:aws-ebs-csi-driver]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=femsa-poc-cluster:coredns]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=femsa-poc-cluster:kube-proxy]
module.aws_alb_controller.helm_release.lb: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.acm.aws_acm_certificate.cert must be replaced
+/- resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.femsa.nullapps.io"
              - resource_record_name  = "_b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c6ff51c72755d07973afd6419140aa13.zfyfvmchrl.acm-validations.aws."
            },
          + {
              + domain_name           = "*.femsa.nullapps.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.poc.femsa.nullapps.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-01-01T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-12-03T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.poc.femsa.nullapps.io",
            # (1 unchanged element hidden)
        ]
        tags                      = {
            "account"      = "poc"
            "name"         = "femsa.nullapps.io Certificate"
            "organization" = "femsa"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.acm.aws_acm_certificate_validation.cert_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "cert_validation" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a" -> (known after apply) # forces replacement
      ~ id                      = "0001-01-01 00:00:00 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io",
        ] -> (known after apply) # forces replacement
    }

  # module.acm.aws_route53_record.cert_validation["*.femsa.nullapps.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io" -> (known after apply)
      ~ id                               = "Z054772710Q777Y4L1NE9__b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_b778d80e485aa00cc9a2afb10c22ce22.femsa.nullapps.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_c6ff51c72755d07973afd6419140aa13.zfyfvmchrl.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.acm.aws_route53_record.cert_validation["*.poc.femsa.nullapps.io"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z054772710Q777Y4L1NE9"
    }

  # module.alb.aws_lb_listener.null-main-internal-listener-https will be updated in-place
  ~ resource "aws_lb_listener" "null-main-internal-listener-https" {
      ~ certificate_arn   = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-east-1:481665089566:listener/app/null-main-balancer-internal/9d882a1d4412bdcc/231224ef0ae8e54e"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.null-main-listener-https will be updated in-place
  ~ resource "aws_lb_listener" "null-main-listener-https" {
      ~ certificate_arn   = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-east-1:481665089566:listener/app/null-main-balancer/2c2715efb5a36246/3091ec1fd1c4e010"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.nullplatform_configuration.nullplatform_provider_config.eks will be updated in-place
  ~ resource "nullplatform_provider_config" "eks" {
      ~ attributes = jsonencode(
          ~ {
              + web_pool_provider = "AWS:WEB_POOL:EKS"
                # (1 unchanged attribute hidden)
            }
        )
        id         = "ecce6d25-1b04-4da5-aece-e2302c484875"
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

Warning: Reference to undefined provider

  on main.tf line 56, in module "alb":
  56:     aws = aws

There is no explicit declaration for local provider name "aws" in module.alb,
so Terraform is assuming you mean to pass a configuration for
"hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)

Warning: Missing required argument

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 5, in provider "aws":
   5: provider "aws" {

The argument "role_arn" is required, but no definition was found.

This will be an error in a future release.

Warning: Argument is deprecated

  with module.iam_roles_policies.aws_iam_role.nullplatform_application_role,
  on modules/iam-roles-policies/main.tf line 119, in resource "aws_iam_role" "nullplatform_application_role":
 119: resource "aws_iam_role" "nullplatform_application_role" {

The inline_policy argument is deprecated. Use the aws_iam_role_policy
resource instead. If Terraform should exclusively manage all inline policy
associations (the current behavior of this argument), use the
aws_iam_role_policies_exclusive resource as well.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```
</details>

Actor: @osKar-vr
Git SHA: `97ecde01d6317a8213e870c7d5378280368e924d`
<!-- Sticky Pull Request Commentterraform-execution -->